tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Image processing tools collection
brew "graphicsmagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Java-based project management
brew "jenv"
brew "maven"
brew "gradle"
# Manage multiple Node.js versions
brew "nvm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
brew "python@3.10"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
brew "ktlint"
brew "kubernetes-cli"
brew "podman"
brew "lefthook"
# Web browser
cask "firefox"
cask "font-fira-code"
# Desktop client for GitHub repositories
# cask "github"
# Web browser
# cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
# cask "iterm2"
# Provides updates to various Microsoft products
# cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# App to write, plan, collaborate, and get organized
# cask "notion"
# Collaboration platform for API development
# cask "postman"
# Music streaming service
# cask "spotify"
# Open-source code editor
# cask "visual-studio-code"
